---
kind: type
id: T:Autodesk.Revit.DB.ControlShape
source: html/4c6c924f-bb86-35de-f160-b2c70905f4bf.htm
---
# Autodesk.Revit.DB.ControlShape

An enumerated type listing four shapes of control that Autodesk Revit supports.

## Syntax (C#)
```csharp
public enum ControlShape
```